Model: "model_8"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_9 (InputLayer)           [(None, 156, 1)]     0           []                               
                                                                                                  
 lstm_8 (LSTM)                  (None, 32)           4352        ['input_9[0][0]']                
                                                                                                  
 fuzzy_layer_8 (FuzzyLayer)     (None, 10)           640         ['lstm_8[0][0]']                 
                                                                                                  
 multiply_8 (Multiply)          (None, 10)           0           ['fuzzy_layer_8[0][0]']          
                                                                                                  
 concatenate_8 (Concatenate)    (None, 20)           0           ['multiply_8[0][0]',             
                                                                  'fuzzy_layer_8[0][0]']          
                                                                                                  
 dense_34 (Dense)               (None, 10)           210         ['concatenate_8[0][0]']          
                                                                                                  
 dense_35 (Dense)               (None, 1)            11          ['dense_34[0][0]']               
                                                                                                  
==================================================================================================
Total params: 5,213
Trainable params: 5,213
Non-trainable params: 0
__________________________________________________________________________________________________
